In [66]:
from faker import Faker

In [67]:
faker = Faker()
for _ in range(10):
    print(f"Datetime between: {faker.date_between(start_date='-18y', end_date='now')}")

Datetime between: 2005-12-13
Datetime between: 2021-06-04
Datetime between: 2010-11-14
Datetime between: 2010-04-14
Datetime between: 2012-02-29
Datetime between: 2015-11-01
Datetime between: 2008-08-30
Datetime between: 2013-06-09
Datetime between: 2011-10-28
Datetime between: 2017-06-13

## Payment Table

In [68]:
import random
import numpy as np

paymentmethods = ["Mastercard", "iDeal", "Visa", "PayPal", "Klarna"]

#Generate random payment method data, k = the number of orders
paymentdata = random.choices(paymentmethods, weights=(40, 10, 8, 24, 18), k=10)

print(paymentdata)

['Mastercard', 'PayPal', 'Visa', 'Visa', 'Klarna', 'Mastercard', 'Mastercard', 'iDeal', 'Mastercard', 'Mastercard']

### Transforming to dataframe in Pandas

In [69]:
import pandas as pd
paymentdf = pd.DataFrame (paymentmethods, columns = ['Payment_Method'])
paymentdf.head()

  Payment_Method
0     Mastercard
1          iDeal
2           Visa
3         PayPal
4         Klarna

In [75]:
#paymentdf.index += 1

### Add new column with payment terms for every payment method

In [76]:
#Create list of conditions
conditions = [
    (paymentdf['Payment_Method'] == 'Mastercard'),
    (paymentdf['Payment_Method'] == 'iDeal'),
    (paymentdf['Payment_Method'] == 'Visa'),
    (paymentdf['Payment_Method'] == 'PayPal'),
    (paymentdf['Payment_Method'] == 'Klarna')
    ]

#Create list of values that will be assigned to the conditions
values = ['End of month', 'Debit', 'End of month', 'Debit', 'Net 15']

#Create new column with values
paymentdf['Payment_Terms'] = np.select(conditions, values)

paymentdf.head(10)

  Payment_Method Payment_Terms
1     Mastercard  End of month
2          iDeal         Debit
3           Visa  End of month
4         PayPal         Debit
5         Klarna        Net 15

## Store Table

In [71]:
stores = [['Amsterdam','Oudezijds Voorburgwal'],
['Stockholm','Drottninggatan'],
['London','Carnaby Street'],
['Warsaw','Nowy Świat'],
['Rome','Via del Corso'],
['Madrid','Calle Preciados'],
['Webshop','http://www.sneaker-factory.com]']
         ]


#Generate random store data, k = the number of orders
storedata = random.choices(stores, weights=(18, 8, 16, 5, 11, 7, 35), k=10)

print(storedata)

[['Webshop', 'http://www.sneaker-factory.com]'], ['London', 'Carnaby Street'], ['Webshop', 'http://www.sneaker-factory.com]'], ['Webshop', 'http://www.sneaker-factory.com]'], ['Webshop', 'http://www.sneaker-factory.com]'], ['Amsterdam', 'Oudezijds Voorburgwal'], ['Amsterdam', 'Oudezijds Voorburgwal'], ['Webshop', 'http://www.sneaker-factory.com]'], ['London', 'Carnaby Street'], ['Webshop', 'http://www.sneaker-factory.com]']]

In [72]:
storedf = pd.DataFrame (stores, columns = ['Store_Location', 'Address'])

storedf.head(10)

  Store_Location                          Address
0      Amsterdam            Oudezijds Voorburgwal
1      Stockholm                   Drottninggatan
2         London                   Carnaby Street
3         Warsaw                       Nowy Świat
4           Rome                    Via del Corso
5         Madrid                  Calle Preciados
6        Webshop  http://www.sneaker-factory.com]

In [74]:
#storedf.index += 1
storedf.index
storedf.head(10)

  Store_Location                          Address
1      Amsterdam            Oudezijds Voorburgwal
2      Stockholm                   Drottninggatan
3         London                   Carnaby Street
4         Warsaw                       Nowy Świat
5           Rome                    Via del Corso
6         Madrid                  Calle Preciados
7        Webshop  http://www.sneaker-factory.com]

## Discount Table

In [80]:
import datetime

faker = Faker()
discountlist = [] 
for _ in range(20):
    discountlist.append((faker.date_between(start_date='-18y', end_date='now')).strftime("%d %b"))
    
print(discountlist)

['15 Nov', '14 Dec', '22 Apr', '18 Nov', '14 Jul', '18 Nov', '11 Feb', '24 Sep', '17 Jun', '09 Dec', '24 Apr', '16 Mar', '20 Apr', '20 Aug', '31 May', '28 Dec', '31 Jan', '23 Feb', '22 Feb', '18 Sep']

In [81]:
for i in discountlist:
    if int(i[:2]) <= 7 and str(i[-3:]) == "Jan":
        print("New Year discount")
    elif i[-3:] == "Dec":
        print("Christmas discount")
    elif (int(i[:2]) >= 21 and str(i[-3:]) == "Mar") or (int(i[:2]) <= 3 and str(i[-3:]) == "Apr"):
        print("Spring deal")
    elif int(i[:2]) == 22 and str(i[-3:]) == "Apr":
        print("Earth day")
    else:
        print("No discount")

No discount
Christmas discount
Earth day
No discount
No discount
No discount
No discount
No discount
No discount
Christmas discount
No discount
No discount
No discount
No discount
No discount
Christmas discount
No discount
No discount
No discount
No discount

## Product table

In [85]:
import itertools
import pandas as pd

size = []
for i in range(36,49):
    size.append(i)

    color = ['Crimson', 'Navy', 'Olive', 'Baby Blue',
         'Cyan', 'Coral', 'Azure', 'Denim', 'Peach'
        ]

#A nested list with all product specifications is used to find all the possible permutations 
productcategories = [['SWEATZY_MEN','SWEATZY_WOMEN',
               'WOVE_MEN','WOVE_WOMEN',
               'BOOTWEAR_MEN','BOOTWEAR_WOMEN',
               'FROVE_MEN','FROVE_WOMEN',
               'SWOONIX_MEN','SWOONIX_WOMEN'
              ],
               ['Crimson', 'Navy', 'Olive', 'Baby Blue',
                'Cyan', 'Coral', 'Azure', 'Denim', 'Peach'],
               size
              ]

### Listing all permutations for products

In [86]:
products = list(itertools.product(*productcategories))

productsdf = pd.DataFrame (products, columns = ['Product_Name', 'Product_Color', 'Product_Size'])
productsdf.head(5)

  Product_Name Product_Color  Product_Size
0  SWEATZY_MEN       Crimson            36
1  SWEATZY_MEN       Crimson            37
2  SWEATZY_MEN       Crimson            38
3  SWEATZY_MEN       Crimson            39
4  SWEATZY_MEN       Crimson            40

In [87]:
kidssize = []
for i in range(20, 37):
    kidssize.append(i)

kidscategories = [['SWEATZY_KIDS', 'WOVE_KIDS', 'BOOTWEAR_KIDS', 'FROVE_KIDS', 'SWOONIX_KIDS'],
                ['Crimson', 'Navy', 'Olive', 'Baby Blue',
                 'Cyan', 'Coral', 'Azure', 'Denim', 'Peach'],
                kidssize
               ]
print(kidscategories)

[['SWEATZY_KIDS', 'WOVE_KIDS', 'BOOTWEAR_KIDS', 'FROVE_KIDS', 'SWOONIX_KIDS'], ['Crimson', 'Navy', 'Olive', 'Baby Blue', 'Cyan', 'Coral', 'Azure', 'Denim', 'Peach'], [20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36]]

### Listing all permutations for the kids products

In [88]:
import itertools
kidsproducts = list(itertools.product(*kidscategories))

In [89]:

kidsproductsdf = pd.DataFrame (kidsproducts, columns = ['Product_Name', 'Product_Color', 'Product_Size'])
kidsproductsdf.head(5)
kidsproductsdf.shape

(765, 3)

### Appending kids dataframe to other dataframe to create one products dataframe

In [90]:
productsdf = productsdf.append(kidsproductsdf)
productsdf.shape
productsdf.head(1700)

    Product_Name Product_Color  Product_Size
0    SWEATZY_MEN       Crimson            36
1    SWEATZY_MEN       Crimson            37
2    SWEATZY_MEN       Crimson            38
3    SWEATZY_MEN       Crimson            39
4    SWEATZY_MEN       Crimson            40
..           ...           ...           ...
525   FROVE_KIDS     Baby Blue            35
526   FROVE_KIDS     Baby Blue            36
527   FROVE_KIDS          Cyan            20
528   FROVE_KIDS          Cyan            21
529   FROVE_KIDS          Cyan            22

[1700 rows x 3 columns]

### Conditions for product price of different shoes

In [93]:
def productprice (row):
    if row['Product_Name'] == 'SWEATZY_KIDS' :
        return 39.95
    if row['Product_Name'] == 'SWEATZY_MEN' or row['Product_Name'] == 'SWEATZY_WOMEN':
        return 49.95
    if row['Product_Name'] == 'WOVE_KIDS' :
        return 49.95
    if row['Product_Name'] == 'WOVE_MEN' or row['Product_Name'] == 'WOVE_WOMEN' :
        return 59.95
    if row['Product_Name'] == 'BOOTWEAR_KIDS' :
        return 64.95
    if row['Product_Name'] == 'BOOTWEAR_MEN' or row['Product_Name'] == 'BOOTWEAR_WOMEN' :
        return 74.95
    if row['Product_Name'] == 'FROVE_KIDS' :
        return 49.95
    if row['Product_Name'] == 'FROVE_MEN' or row['Product_Name'] == 'FROVE_WOMEN' :
        return 59.95
    if row['Product_Name'] == 'SWOONIX_KIDS' :
        return 54.95
    if row['Product_Name'] == 'SWOONIX_MEN' or row['Product_Name'] == 'SWOONIX_WOMEN' :
        return 64.95

In [94]:
productsdf.apply (lambda row: productprice(row), axis=1)

0      49.95
1      49.95
2      49.95
3      49.95
4      49.95
       ...
760    54.95
761    54.95
762    54.95
763    54.95
764    54.95
Length: 1935, dtype: float64

In [95]:
productsdf['Product_Price'] = productsdf.apply (lambda row: productprice(row), axis=1)
productsdf.head(1700)

    Product_Name Product_Color  Product_Size  Product_Price
0    SWEATZY_MEN       Crimson            36          49.95
1    SWEATZY_MEN       Crimson            37          49.95
2    SWEATZY_MEN       Crimson            38          49.95
3    SWEATZY_MEN       Crimson            39          49.95
4    SWEATZY_MEN       Crimson            40          49.95
..           ...           ...           ...            ...
525   FROVE_KIDS     Baby Blue            35          49.95
526   FROVE_KIDS     Baby Blue            36          49.95
527   FROVE_KIDS          Cyan            20          49.95
528   FROVE_KIDS          Cyan            21          49.95
529   FROVE_KIDS          Cyan            22          49.95

[1700 rows x 4 columns]

### Changing index start to 1 instead of 0

In [97]:

#productsdf.index += 1
productsdf.head()

  Product_Name Product_Color  Product_Size  Product_Price
1  SWEATZY_MEN       Crimson            36          49.95
2  SWEATZY_MEN       Crimson            37          49.95
3  SWEATZY_MEN       Crimson            38          49.95
4  SWEATZY_MEN       Crimson            39          49.95
5  SWEATZY_MEN       Crimson            40          49.95

In [98]:
productsdf.to_csv('Products.csv')